net-bsd/share/man/man4/man4.evbarm/vcaudio.4
.\" $NetBSD: vcaudio.4,v 1.2 2021/02/26 10:33:46 nia Exp $
.\"
.\" Copyright (c) 2021 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd February 26, 2021
.Dt VCAUDIO 4
.Os
.Sh NAME
.Nm vcaudio
.Nd Broadcom VideoCore integrated audio device driver
.Sh SYNOPSIS
.Cd "vcaudio* at vchiq?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the VideoCore 4 audio interface found on
Broadcom SoCs used in boards such as the Raspberry Pi.
.Pp
Three outputs are supported:
.Li auto ,
.Li headphones ,
and
.Li hdmi .
The selected output can be changed using the
.Li outputs.select
.Xr mixerctl 1
variable.
.Li headphones
corresponds to the analog 3.5mm jack on the Raspberry Pi.
.Pp
The hardware does not support recording.
.Sh SEE ALSO
.Xr mixerctl 1 ,
.Xr audio 4 ,
.Xr mixer 4 ,
.Xr vchiq 4
.Sh HISTORY
The
.Nm
device driver appeared in
.Nx 7.0 .
.Sh BUGS
The playback block size is fixed at 40ms of audio.
The hardware output format is fixed at stereo 48kHz 16-bit LPCM so is
not configurable with
.Xr audiocfg 1 .
